Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
  + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_integration_response" "runs-filtering_terms_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id will be created
  + resource "aws_api_gateway_integration_response" "runs-id" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses will be created
  + resource "aws_api_gateway_integration_response" "runs-id-analyses" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-analyses_post will be created
  + resource "aws_api_gateway_integration_response" "runs-id-analyses_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants will be created
  + resource "aws_api_gateway_integration_response" "runs-id-g_variants" {
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_integration_response" "runs-id-g_variants_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs-id_post will be created
  + resource "aws_api_gateway_integration_response" "runs-id_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_integration_response.runs_post will be created
  + resource "aws_api_gateway_integration_response" "runs_post" {
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + resource_id        = (known after apply)
      + response_templates = {
          + "application/json" = null
        }
      + rest_api_id        = (known after apply)
      + status_code        = "200"
    }

  # module.sbeacon.aws_api_gateway_method.admin_proxy will be created
  + resource "aws_api_gateway_method" "admin_proxy" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "ANY"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.proxy" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.analyses will be created
  + resource "aws_api_gateway_method" "analyses" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-filtering_terms will be created
  + resource "aws_api_gateway_method" "analyses-filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "analyses-filtering_terms_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id will be created
  + resource "aws_api_gateway_method" "analyses-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants will be created
  + resource "aws_api_gateway_method" "analyses-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "analyses-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.analyses-id_post will be created
  + resource "aws_api_gateway_method" "analyses-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.analyses_post will be created
  + resource "aws_api_gateway_method" "analyses_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples will be created
  + resource "aws_api_gateway_method" "biosamples" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_method" "biosamples-filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "biosamples-filtering_terms_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id will be created
  + resource "aws_api_gateway_method" "biosamples-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses will be created
  + resource "aws_api_gateway_method" "biosamples-id-analyses" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-analyses_post will be created
  + resource "aws_api_gateway_method" "biosamples-id-analyses_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_method" "biosamples-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "biosamples-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs will be created
  + resource "aws_api_gateway_method" "biosamples-id-runs" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id-runs_post will be created
  + resource "aws_api_gateway_method" "biosamples-id-runs_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples-id_post will be created
  + resource "aws_api_gateway_method" "biosamples-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.biosamples_post will be created
  + resource "aws_api_gateway_method" "biosamples_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.configuration will be created
  + resource "aws_api_gateway_method" "configuration" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets will be created
  + resource "aws_api_gateway_method" "datasets" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms will be created
  + resource "aws_api_gateway_method" "datasets-filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "datasets-filtering_terms_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id will be created
  + resource "aws_api_gateway_method" "datasets-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples will be created
  + resource "aws_api_gateway_method" "datasets-id-biosamples" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-biosamples_post will be created
  + resource "aws_api_gateway_method" "datasets-id-biosamples_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_method" "datasets-id-filtering_terms" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "datasets-id-filtering_terms_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants will be created
  + resource "aws_api_gateway_method" "datasets-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "datasets-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals will be created
  + resource "aws_api_gateway_method" "datasets-id-individuals" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_method" "datasets-id-individuals_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets-id_post will be created
  + resource "aws_api_gateway_method" "datasets-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.datasets_post will be created
  + resource "aws_api_gateway_method" "datasets_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.dportal_proxy will be created
  + resource "aws_api_gateway_method" "dportal_proxy" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "ANY"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.proxy" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.entry_types will be created
  + resource "aws_api_gateway_method" "entry_types" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.filtering_terms will be created
  + resource "aws_api_gateway_method" "filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants will be created
  + resource "aws_api_gateway_method" "g_variants" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id will be created
  + resource "aws_api_gateway_method" "g_variants-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples will be created
  + resource "aws_api_gateway_method" "g_variants-id-biosamples" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-biosamples_post will be created
  + resource "aws_api_gateway_method" "g_variants-id-biosamples_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals will be created
  + resource "aws_api_gateway_method" "g_variants-id-individuals" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id-individuals_post will be created
  + resource "aws_api_gateway_method" "g_variants-id-individuals_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants-id_post will be created
  + resource "aws_api_gateway_method" "g_variants-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.g_variants_post will be created
  + resource "aws_api_gateway_method" "g_variants_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals will be created
  + resource "aws_api_gateway_method" "individuals" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms will be created
  + resource "aws_api_gateway_method" "individuals-filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "individuals-filtering_terms_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id will be created
  + resource "aws_api_gateway_method" "individuals-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples will be created
  + resource "aws_api_gateway_method" "individuals-id-biosamples" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-biosamples_post will be created
  + resource "aws_api_gateway_method" "individuals-id-biosamples_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants will be created
  + resource "aws_api_gateway_method" "individuals-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "individuals-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals-id_post will be created
  + resource "aws_api_gateway_method" "individuals-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.individuals_post will be created
  + resource "aws_api_gateway_method" "individuals_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.info will be created
  + resource "aws_api_gateway_method" "info" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.map will be created
  + resource "aws_api_gateway_method" "map" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.projects will be created
  + resource "aws_api_gateway_method" "projects" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.root-get will be created
  + resource "aws_api_gateway_method" "root-get" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs will be created
  + resource "aws_api_gateway_method" "runs" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms will be created
  + resource "aws_api_gateway_method" "runs-filtering_terms" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "GET"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-filtering_terms_post will be created
  + resource "aws_api_gateway_method" "runs-filtering_terms_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id will be created
  + resource "aws_api_gateway_method" "runs-id" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses will be created
  + resource "aws_api_gateway_method" "runs-id-analyses" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-analyses_post will be created
  + resource "aws_api_gateway_method" "runs-id-analyses_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants will be created
  + resource "aws_api_gateway_method" "runs-id-g_variants" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "GET"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id-g_variants_post will be created
  + resource "aws_api_gateway_method" "runs-id-g_variants_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs-id_post will be created
  + resource "aws_api_gateway_method" "runs-id_post" {
      + api_key_required   = false
      + authorization      = "COGNITO_USER_POOLS"
      + authorizer_id      = (known after apply)
      + http_method        = "POST"
      + id                 = (known after apply)
      + region             = "ap-southeast-3"
      + request_parameters = {
          + "method.request.path.id" = true
        }
      + resource_id        = (known after apply)
      + rest_api_id        = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method.runs_post will be created
  + resource "aws_api_gateway_method" "runs_post" {
      + api_key_required = false
      + authorization    = "COGNITO_USER_POOLS"
      + authorizer_id    = (known after apply)
      + http_method      = "POST"
      + id               = (known after apply)
      + region           = "ap-southeast-3"
      + resource_id      = (known after apply)
      + rest_api_id      = (known after apply)
    }

  # module.sbeacon.aws_api_gateway_method_response.admin_proxy will be created
  + resource "aws_api_gateway_method_response" "admin_proxy" {
      + http_method         = "ANY"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses will be created
  + resource "aws_api_gateway_method_response" "analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "analyses-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "analyses-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id will be created
  + resource "aws_api_gateway_method_response" "analyses-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "analyses-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "analyses-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses-id_post will be created
  + resource "aws_api_gateway_method_response" "analyses-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.analyses_post will be created
  + resource "aws_api_gateway_method_response" "analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples will be created
  + resource "aws_api_gateway_method_response" "biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "biosamples-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id will be created
  + resource "aws_api_gateway_method_response" "biosamples-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-analyses" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-analyses_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-analyses_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-runs" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id-runs_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id-runs_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples-id_post will be created
  + resource "aws_api_gateway_method_response" "biosamples-id_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.biosamples_post will be created
  + resource "aws_api_gateway_method_response" "biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.configuration will be created
  + resource "aws_api_gateway_method_response" "configuration" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets will be created
  + resource "aws_api_gateway_method_response" "datasets" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "datasets-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "datasets-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id will be created
  + resource "aws_api_gateway_method_response" "datasets-id" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples will be created
  + resource "aws_api_gateway_method_response" "datasets-id-biosamples" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-biosamples_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-biosamples_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms will be created
  + resource "aws_api_gateway_method_response" "datasets-id-filtering_terms" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-filtering_terms_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-filtering_terms_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants will be created
  + resource "aws_api_gateway_method_response" "datasets-id-g_variants" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-g_variants_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-g_variants_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals will be created
  + resource "aws_api_gateway_method_response" "datasets-id-individuals" {
      + http_method         = "GET"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id-individuals_post will be created
  + resource "aws_api_gateway_method_response" "datasets-id-individuals_post" {
      + http_method         = "POST"
      + id                  = (known after apply)
      + region              = "ap-southeast-3"
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Origin" = true
        }
      + rest_api_id         = (known after apply)
      + status_code         = "200"
    }

  # module.sbeacon.aws_api_gateway_method_response.datasets-id_post will be created
  + resource "aws_api_gateway_method_response" "datasets-
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.